In [1]:
import pandas as pd
import numpy as np
from numpy import asarray
import seaborn as sns

In [2]:
df = pd.read_csv('./data/train.csv',low_memory=False)

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 28 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   ID                        100000 non-null  object
 1   Customer_ID               100000 non-null  object
 2   Month                     100000 non-null  object
 3   Name                      90015 non-null   object
 4   Age                       100000 non-null  object
 5   SSN                       100000 non-null  object
 6   Occupation                100000 non-null  object
 7   Annual_Income             100000 non-null  object
 8   Monthly_Inhand_Salary     84998 non-null   float64
 9   Num_Bank_Accounts         100000 non-null  int64
 10  Num_Credit_Card           100000 non-null  int64
 11  Interest_Rate             100000 non-null  int64
 12  Num_of_Loan               100000 non-null  object
 13  Type_of_Loan              88592 non-null   object
 14  Delay_from_due_date       100000 non-null  int64
 15  Num_of_Delayed_Payment    92998 non-null   object
 16  Changed_Credit_Limit      100000 non-null  object
 17  Num_Credit_Inquiries      98035 non-null   float64
 18  Credit_Mix                100000 non-null  object
 19  Outstanding_Debt          100000 non-null  object
 20  Credit_Utilization_Ratio  100000 non-null  float64
 21  Credit_History_Age        90970 non-null   object
 22  Payment_of_Min_Amount     100000 non-null  object
 23  Total_EMI_per_month       100000 non-null  float64
 24  Amount_invested_monthly   95521 non-null   object
 25  Payment_Behaviour         100000 non-null  object
 26  Monthly_Balance           98800 non-null   object
 27  Credit_Score              100000 non-null  object
dtypes: float64(4), int64(4), object(20)
memory usage: 21.4+ MB

In [4]:
df.dropna(inplace=True)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 53049 entries, 0 to 99999
Data columns (total 28 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   ID                        53049 non-null  object
 1   Customer_ID               53049 non-null  object
 2   Month                     53049 non-null  object
 3   Name                      53049 non-null  object
 4   Age                       53049 non-null  object
 5   SSN                       53049 non-null  object
 6   Occupation                53049 non-null  object
 7   Annual_Income             53049 non-null  object
 8   Monthly_Inhand_Salary     53049 non-null  float64
 9   Num_Bank_Accounts         53049 non-null  int64
 10  Num_Credit_Card           53049 non-null  int64
 11  Interest_Rate             53049 non-null  int64
 12  Num_of_Loan               53049 non-null  object
 13  Type_of_Loan              53049 non-null  object
 14  Delay_from_due_date       53049 non-null  int64
 15  Num_of_Delayed_Payment    53049 non-null  object
 16  Changed_Credit_Limit      53049 non-null  object
 17  Num_Credit_Inquiries      53049 non-null  float64
 18  Credit_Mix                53049 non-null  object
 19  Outstanding_Debt          53049 non-null  object
 20  Credit_Utilization_Ratio  53049 non-null  float64
 21  Credit_History_Age        53049 non-null  object
 22  Payment_of_Min_Amount     53049 non-null  object
 23  Total_EMI_per_month       53049 non-null  float64
 24  Amount_invested_monthly   53049 non-null  object
 25  Payment_Behaviour         53049 non-null  object
 26  Monthly_Balance           53049 non-null  object
 27  Credit_Score              53049 non-null  object
dtypes: float64(4), int64(4), object(20)
memory usage: 11.7+ MB

In [6]:
df.head()

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
0,0x1602,CUS_0xd40,January,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,_,809.98,26.822620,22 Years and 1 Months,No,49.574949,80.41529543900253,High_spent_Small_value_payments,312.49408867943663,Good
6,0x1608,CUS_0xd40,July,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,Good,809.98,22.537593,22 Years and 7 Months,No,49.574949,178.3440674122349,Low_spent_Small_value_payments,244.5653167062043,Good
8,0x160e,CUS_0x21b1,January,Rick Rothackerj,28_,004-07-5839,_______,34847.84,3037.986667,2,...,Good,605.03,24.464031,26 Years and 7 Months,No,18.816215,104.291825168246,Low_spent_Small_value_payments,470.69062692529184,Standard
9,0x160f,CUS_0x21b1,February,Rick Rothackerj,28,004-07-5839,Teacher,34847.84,3037.986667,2,...,Good,605.03,38.550848,26 Years and 8 Months,No,18.816215,40.39123782853101,High_spent_Large_value_payments,484.5912142650067,Good
10,0x1610,CUS_0x21b1,March,Rick Rothackerj,28,004-07-5839,Teacher,34847.84_,3037.986667,2,...,_,605.03,33.224951,26 Years and 9 Months,No,18.816215,58.51597569589465,High_spent_Large_value_payments,466.46647639764313,Standard

In [7]:
df.drop(['ID','Customer_ID','Month','Name','SSN','Type_of_Loan','Monthly_Balance'],inplace=True, axis=1)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 53049 entries, 0 to 99999
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       53049 non-null  object
 1   Occupation                53049 non-null  object
 2   Annual_Income             53049 non-null  object
 3   Monthly_Inhand_Salary     53049 non-null  float64
 4   Num_Bank_Accounts         53049 non-null  int64
 5   Num_Credit_Card           53049 non-null  int64
 6   Interest_Rate             53049 non-null  int64
 7   Num_of_Loan               53049 non-null  object
 8   Delay_from_due_date       53049 non-null  int64
 9   Num_of_Delayed_Payment    53049 non-null  object
 10  Changed_Credit_Limit      53049 non-null  object
 11  Num_Credit_Inquiries      53049 non-null  float64
 12  Credit_Mix                53049 non-null  object
 13  Outstanding_Debt          53049 non-null  object
 14  Credit_Utilization_Ratio  53049 non-null  float64
 15  Credit_History_Age        53049 non-null  object
 16  Payment_of_Min_Amount     53049 non-null  object
 17  Total_EMI_per_month       53049 non-null  float64
 18  Amount_invested_monthly   53049 non-null  object
 19  Payment_Behaviour         53049 non-null  object
 20  Credit_Score              53049 non-null  object
dtypes: float64(4), int64(4), object(13)
memory usage: 8.9+ MB

In [9]:
df['Age'] = df.Age.str.replace('_','')

In [10]:
df['Age'] = df.Age.astype(float)

In [11]:
df = df.loc[(df['Age'] > 16) & (df['Age'] < 90)]

In [12]:
df['Age'].value_counts()

38.0    1657
28.0    1590
26.0    1558
34.0    1542
31.0    1541
27.0    1540
36.0    1539
35.0    1530
44.0    1529
25.0    1525
32.0    1518
43.0    1515
37.0    1509
39.0    1506
19.0    1501
22.0    1490
24.0    1490
41.0    1488
30.0    1449
23.0    1446
21.0    1440
29.0    1435
20.0    1417
45.0    1407
42.0    1383
40.0    1370
18.0    1359
33.0    1334
17.0     875
46.0     802
52.0     659
50.0     655
55.0     646
49.0     643
48.0     641
47.0     607
54.0     607
53.0     595
51.0     575
56.0     167
Name: Age, dtype: int64

In [13]:
df['Occupation'].value_counts()

_______          3446
Lawyer           3303
Mechanic         3129
Architect        3115
Doctor           3096
Accountant       3076
Engineer         3072
Entrepreneur     3066
Teacher          3050
Media_Manager    3047
Scientist        3036
Developer        3026
Journalist       2938
Writer           2924
Musician         2921
Manager          2835
Name: Occupation, dtype: int64

In [14]:
df['Occupation'] = df.Occupation.str.replace('_______','other')

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 49080 entries, 0 to 99999
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       49080 non-null  float64
 1   Occupation                49080 non-null  object
 2   Annual_Income             49080 non-null  object
 3   Monthly_Inhand_Salary     49080 non-null  float64
 4   Num_Bank_Accounts         49080 non-null  int64
 5   Num_Credit_Card           49080 non-null  int64
 6   Interest_Rate             49080 non-null  int64
 7   Num_of_Loan               49080 non-null  object
 8   Delay_from_due_date       49080 non-null  int64
 9   Num_of_Delayed_Payment    49080 non-null  object
 10  Changed_Credit_Limit      49080 non-null  object
 11  Num_Credit_Inquiries      49080 non-null  float64
 12  Credit_Mix                49080 non-null  object
 13  Outstanding_Debt          49080 non-null  object
 14  Credit_Utilization_Ratio  49080 non-null  float64
 15  Credit_History_Age        49080 non-null  object
 16  Payment_of_Min_Amount     49080 non-null  object
 17  Total_EMI_per_month       49080 non-null  float64
 18  Amount_invested_monthly   49080 non-null  object
 19  Payment_Behaviour         49080 non-null  object
 20  Credit_Score              49080 non-null  object
dtypes: float64(5), int64(4), object(12)
memory usage: 8.2+ MB

In [16]:
df['Annual_Income'] = df.Annual_Income.str.replace('_','')

In [17]:
df['Annual_Income'].value_counts()

40341.16      13
20867.67      11
36585.12      10
9141.63       10
17816.75      10
              ..
19706755.0     1
3252194.0      1
14532812.0     1
4442389.0      1
13547543.0     1
Name: Annual_Income, Length: 11078, dtype: int64

In [18]:
df['Annual_Income'] = df.Annual_Income.astype(float)

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 49080 entries, 0 to 99999
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       49080 non-null  float64
 1   Occupation                49080 non-null  object
 2   Annual_Income             49080 non-null  float64
 3   Monthly_Inhand_Salary     49080 non-null  float64
 4   Num_Bank_Accounts         49080 non-null  int64
 5   Num_Credit_Card           49080 non-null  int64
 6   Interest_Rate             49080 non-null  int64
 7   Num_of_Loan               49080 non-null  object
 8   Delay_from_due_date       49080 non-null  int64
 9   Num_of_Delayed_Payment    49080 non-null  object
 10  Changed_Credit_Limit      49080 non-null  object
 11  Num_Credit_Inquiries      49080 non-null  float64
 12  Credit_Mix                49080 non-null  object
 13  Outstanding_Debt          49080 non-null  object
 14  Credit_Utilization_Ratio  49080 non-null  float64
 15  Credit_History_Age        49080 non-null  object
 16  Payment_of_Min_Amount     49080 non-null  object
 17  Total_EMI_per_month       49080 non-null  float64
 18  Amount_invested_monthly   49080 non-null  object
 19  Payment_Behaviour         49080 non-null  object
 20  Credit_Score              49080 non-null  object
dtypes: float64(6), int64(4), object(11)
memory usage: 8.2+ MB

In [20]:
df['Num_of_Loan'] = df.Num_of_Loan.str.replace('_','')

In [21]:
df['Num_of_Loan'] = df.Num_of_Loan.astype(float)

In [22]:
df = df.loc[(df['Num_of_Loan'] > 1) & (df['Num_of_Loan'] < 100)]

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 40736 entries, 0 to 99999
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       40736 non-null  float64
 1   Occupation                40736 non-null  object
 2   Annual_Income             40736 non-null  float64
 3   Monthly_Inhand_Salary     40736 non-null  float64
 4   Num_Bank_Accounts         40736 non-null  int64
 5   Num_Credit_Card           40736 non-null  int64
 6   Interest_Rate             40736 non-null  int64
 7   Num_of_Loan               40736 non-null  float64
 8   Delay_from_due_date       40736 non-null  int64
 9   Num_of_Delayed_Payment    40736 non-null  object
 10  Changed_Credit_Limit      40736 non-null  object
 11  Num_Credit_Inquiries      40736 non-null  float64
 12  Credit_Mix                40736 non-null  object
 13  Outstanding_Debt          40736 non-null  object
 14  Credit_Utilization_Ratio  40736 non-null  float64
 15  Credit_History_Age        40736 non-null  object
 16  Payment_of_Min_Amount     40736 non-null  object
 17  Total_EMI_per_month       40736 non-null  float64
 18  Amount_invested_monthly   40736 non-null  object
 19  Payment_Behaviour         40736 non-null  object
 20  Credit_Score              40736 non-null  object
dtypes: float64(7), int64(4), object(10)
memory usage: 6.8+ MB

In [24]:
df['Num_of_Delayed_Payment'].value_counts()

19      2588
16      2444
17      2434
18      2415
20      2366
        ...
848_       1
3489       1
1685       1
1673       1
2047       1
Name: Num_of_Delayed_Payment, Length: 375, dtype: int64

In [25]:
df['Num_of_Delayed_Payment'] = df.Num_of_Delayed_Payment.str.replace('_','')

In [26]:
df['Num_of_Delayed_Payment'] = df.Num_of_Delayed_Payment.astype(float)

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 40736 entries, 0 to 99999
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       40736 non-null  float64
 1   Occupation                40736 non-null  object
 2   Annual_Income             40736 non-null  float64
 3   Monthly_Inhand_Salary     40736 non-null  float64
 4   Num_Bank_Accounts         40736 non-null  int64
 5   Num_Credit_Card           40736 non-null  int64
 6   Interest_Rate             40736 non-null  int64
 7   Num_of_Loan               40736 non-null  float64
 8   Delay_from_due_date       40736 non-null  int64
 9   Num_of_Delayed_Payment    40736 non-null  float64
 10  Changed_Credit_Limit      40736 non-null  object
 11  Num_Credit_Inquiries      40736 non-null  float64
 12  Credit_Mix                40736 non-null  object
 13  Outstanding_Debt          40736 non-null  object
 14  Credit_Utilization_Ratio  40736 non-null  float64
 15  Credit_History_Age        40736 non-null  object
 16  Payment_of_Min_Amount     40736 non-null  object
 17  Total_EMI_per_month       40736 non-null  float64
 18  Amount_invested_monthly   40736 non-null  object
 19  Payment_Behaviour         40736 non-null  object
 20  Credit_Score              40736 non-null  object
dtypes: float64(8), int64(4), object(9)
memory usage: 6.8+ MB

In [28]:
df['Changed_Credit_Limit'].value_counts()

_        838
8.22      73
11.5      72
10.54     51
7.64      50
        ...
-3.28      1
22.53      1
-6.2       1
30.91      1
-3.41      1
Name: Changed_Credit_Limit, Length: 3796, dtype: int64

In [29]:
df.Changed_Credit_Limit.replace('_', np.nan, inplace=True)

In [30]:
df['Changed_Credit_Limit'] = df.Changed_Credit_Limit.astype(float)

In [31]:
df['Changed_Credit_Limit'].value_counts()

 8.22     73
 11.50    72
 10.54    51
 7.64     50
 11.63    49
          ..
-3.28      1
 22.53     1
-6.20      1
 30.91     1
-3.41      1
Name: Changed_Credit_Limit, Length: 3795, dtype: int64

In [32]:
df.dropna(inplace=True)

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 39898 entries, 0 to 99999
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       39898 non-null  float64
 1   Occupation                39898 non-null  object
 2   Annual_Income             39898 non-null  float64
 3   Monthly_Inhand_Salary     39898 non-null  float64
 4   Num_Bank_Accounts         39898 non-null  int64
 5   Num_Credit_Card           39898 non-null  int64
 6   Interest_Rate             39898 non-null  int64
 7   Num_of_Loan               39898 non-null  float64
 8   Delay_from_due_date       39898 non-null  int64
 9   Num_of_Delayed_Payment    39898 non-null  float64
 10  Changed_Credit_Limit      39898 non-null  float64
 11  Num_Credit_Inquiries      39898 non-null  float64
 12  Credit_Mix                39898 non-null  object
 13  Outstanding_Debt          39898 non-null  object
 14  Credit_Utilization_Ratio  39898 non-null  float64
 15  Credit_History_Age        39898 non-null  object
 16  Payment_of_Min_Amount     39898 non-null  object
 17  Total_EMI_per_month       39898 non-null  float64
 18  Amount_invested_monthly   39898 non-null  object
 19  Payment_Behaviour         39898 non-null  object
 20  Credit_Score              39898 non-null  object
dtypes: float64(9), int64(4), object(8)
memory usage: 6.7+ MB

In [34]:
df['Credit_Mix'] = df.Credit_Mix.str.replace('_','other')

In [35]:
df['Credit_Mix'].value_counts()

Standard    14452
Bad          9448
other        8115
Good         7883
Name: Credit_Mix, dtype: int64

In [36]:
df['Outstanding_Debt'] = df.Outstanding_Debt.str.replace('_','')

In [37]:
df['Outstanding_Debt'] = df.Outstanding_Debt.astype(float)

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 39898 entries, 0 to 99999
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       39898 non-null  float64
 1   Occupation                39898 non-null  object
 2   Annual_Income             39898 non-null  float64
 3   Monthly_Inhand_Salary     39898 non-null  float64
 4   Num_Bank_Accounts         39898 non-null  int64
 5   Num_Credit_Card           39898 non-null  int64
 6   Interest_Rate             39898 non-null  int64
 7   Num_of_Loan               39898 non-null  float64
 8   Delay_from_due_date       39898 non-null  int64
 9   Num_of_Delayed_Payment    39898 non-null  float64
 10  Changed_Credit_Limit      39898 non-null  float64
 11  Num_Credit_Inquiries      39898 non-null  float64
 12  Credit_Mix                39898 non-null  object
 13  Outstanding_Debt          39898 non-null  float64
 14  Credit_Utilization_Ratio  39898 non-null  float64
 15  Credit_History_Age        39898 non-null  object
 16  Payment_of_Min_Amount     39898 non-null  object
 17  Total_EMI_per_month       39898 non-null  float64
 18  Amount_invested_monthly   39898 non-null  object
 19  Payment_Behaviour         39898 non-null  object
 20  Credit_Score              39898 non-null  object
dtypes: float64(10), int64(4), object(7)
memory usage: 6.7+ MB

In [39]:
df['Credit_History_Age'] = df['Credit_History_Age'].str[:2]

In [40]:
df['Credit_History_Age']= df.Credit_History_Age.astype(float)

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 39898 entries, 0 to 99999
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       39898 non-null  float64
 1   Occupation                39898 non-null  object
 2   Annual_Income             39898 non-null  float64
 3   Monthly_Inhand_Salary     39898 non-null  float64
 4   Num_Bank_Accounts         39898 non-null  int64
 5   Num_Credit_Card           39898 non-null  int64
 6   Interest_Rate             39898 non-null  int64
 7   Num_of_Loan               39898 non-null  float64
 8   Delay_from_due_date       39898 non-null  int64
 9   Num_of_Delayed_Payment    39898 non-null  float64
 10  Changed_Credit_Limit      39898 non-null  float64
 11  Num_Credit_Inquiries      39898 non-null  float64
 12  Credit_Mix                39898 non-null  object
 13  Outstanding_Debt          39898 non-null  float64
 14  Credit_Utilization_Ratio  39898 non-null  float64
 15  Credit_History_Age        39898 non-null  float64
 16  Payment_of_Min_Amount     39898 non-null  object
 17  Total_EMI_per_month       39898 non-null  float64
 18  Amount_invested_monthly   39898 non-null  object
 19  Payment_Behaviour         39898 non-null  object
 20  Credit_Score              39898 non-null  object
dtypes: float64(11), int64(4), object(6)
memory usage: 6.7+ MB

In [42]:
df['Payment_of_Min_Amount'].value_counts()

Yes    23514
No     11649
NM      4735
Name: Payment_of_Min_Amount, dtype: int64

In [43]:
df['Amount_invested_monthly'].value_counts()

__10000__             1774
0.0                     82
80.41529543900253        1
465.5475059350328        1
84.24536179382086        1
                      ...
232.63472555013408       1
355.75712170015504       1
74.16157614915758        1
268.6482203525983        1
167.1638651610451        1
Name: Amount_invested_monthly, Length: 38044, dtype: int64

In [44]:
df['Amount_invested_monthly'] = df.Amount_invested_monthly.str.replace('_','')

In [45]:
df['Amount_invested_monthly']= df.Amount_invested_monthly.astype(float)

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 39898 entries, 0 to 99999
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       39898 non-null  float64
 1   Occupation                39898 non-null  object
 2   Annual_Income             39898 non-null  float64
 3   Monthly_Inhand_Salary     39898 non-null  float64
 4   Num_Bank_Accounts         39898 non-null  int64
 5   Num_Credit_Card           39898 non-null  int64
 6   Interest_Rate             39898 non-null  int64
 7   Num_of_Loan               39898 non-null  float64
 8   Delay_from_due_date       39898 non-null  int64
 9   Num_of_Delayed_Payment    39898 non-null  float64
 10  Changed_Credit_Limit      39898 non-null  float64
 11  Num_Credit_Inquiries      39898 non-null  float64
 12  Credit_Mix                39898 non-null  object
 13  Outstanding_Debt          39898 non-null  float64
 14  Credit_Utilization_Ratio  39898 non-null  float64
 15  Credit_History_Age        39898 non-null  float64
 16  Payment_of_Min_Amount     39898 non-null  object
 17  Total_EMI_per_month       39898 non-null  float64
 18  Amount_invested_monthly   39898 non-null  float64
 19  Payment_Behaviour         39898 non-null  object
 20  Credit_Score              39898 non-null  object
dtypes: float64(12), int64(4), object(5)
memory usage: 6.7+ MB

In [47]:
df['Payment_Behaviour'].value_counts()

Low_spent_Small_value_payments      10350
High_spent_Medium_value_payments     7054
Low_spent_Medium_value_payments      5461
High_spent_Large_value_payments      5253
High_spent_Small_value_payments      4605
Low_spent_Large_value_payments       4228
!@9#%8                               2947
Name: Payment_Behaviour, dtype: int64

In [48]:
df['Credit_Score'].value_counts()

Standard    20650
Poor        13281
Good         5967
Name: Credit_Score, dtype: int64

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 39898 entries, 0 to 99999
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       39898 non-null  float64
 1   Occupation                39898 non-null  object
 2   Annual_Income             39898 non-null  float64
 3   Monthly_Inhand_Salary     39898 non-null  float64
 4   Num_Bank_Accounts         39898 non-null  int64
 5   Num_Credit_Card           39898 non-null  int64
 6   Interest_Rate             39898 non-null  int64
 7   Num_of_Loan               39898 non-null  float64
 8   Delay_from_due_date       39898 non-null  int64
 9   Num_of_Delayed_Payment    39898 non-null  float64
 10  Changed_Credit_Limit      39898 non-null  float64
 11  Num_Credit_Inquiries      39898 non-null  float64
 12  Credit_Mix                39898 non-null  object
 13  Outstanding_Debt          39898 non-null  float64
 14  Credit_Utilization_Ratio  39898 non-null  float64
 15  Credit_History_Age        39898 non-null  float64
 16  Payment_of_Min_Amount     39898 non-null  object
 17  Total_EMI_per_month       39898 non-null  float64
 18  Amount_invested_monthly   39898 non-null  float64
 19  Payment_Behaviour         39898 non-null  object
 20  Credit_Score              39898 non-null  object
dtypes: float64(12), int64(4), object(5)
memory usage: 6.7+ MB

In [50]:
df.Credit_Score.value_counts()

Standard    20650
Poor        13281
Good         5967
Name: Credit_Score, dtype: int64

In [51]:
score_mapper = {"Poor":1, "Standard":2, "Good":3}

In [52]:
df["Credit_Score"] = df["Credit_Score"].replace(score_mapper)

In [53]:
df.head()

,Age,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,Num_Credit_Card,Interest_Rate,Num_of_Loan,Delay_from_due_date,Num_of_Delayed_Payment,...,Num_Credit_Inquiries,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Credit_Score
0,23.0,Scientist,19114.12,1824.843333,3,4,3,4.0,3,7.0,...,4.0,other,809.98,26.822620,22.0,No,49.574949,80.415295,High_spent_Small_value_payments,3
6,23.0,Scientist,19114.12,1824.843333,3,4,3,4.0,3,8.0,...,4.0,Good,809.98,22.537593,22.0,No,49.574949,178.344067,Low_spent_Small_value_payments,3
16,34.0,other,143162.64,12187.220000,1,5,8,3.0,5,8.0,...,3.0,Good,1303.01,28.616735,17.0,No,246.992319,168.413703,!@9#%8,3
20,34.0,other,143162.64,12187.220000,1,5,8,3.0,10,5.0,...,3.0,Good,1303.01,31.376150,18.0,No,246.992319,430.947528,Low_spent_Large_value_payments,3
23,34.0,Engineer,143162.64,12187.220000,1,5,8,3.0,8,6.0,...,3.0,Good,1303.01,38.374753,18.0,No,246.992319,10000.000000,High_spent_Small_value_payments,2

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 39898 entries, 0 to 99999
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       39898 non-null  float64
 1   Occupation                39898 non-null  object
 2   Annual_Income             39898 non-null  float64
 3   Monthly_Inhand_Salary     39898 non-null  float64
 4   Num_Bank_Accounts         39898 non-null  int64
 5   Num_Credit_Card           39898 non-null  int64
 6   Interest_Rate             39898 non-null  int64
 7   Num_of_Loan               39898 non-null  float64
 8   Delay_from_due_date       39898 non-null  int64
 9   Num_of_Delayed_Payment    39898 non-null  float64
 10  Changed_Credit_Limit      39898 non-null  float64
 11  Num_Credit_Inquiries      39898 non-null  float64
 12  Credit_Mix                39898 non-null  object
 13  Outstanding_Debt          39898 non-null  float64
 14  Credit_Utilization_Ratio  39898 non-null  float64
 15  Credit_History_Age        39898 non-null  float64
 16  Payment_of_Min_Amount     39898 non-null  object
 17  Total_EMI_per_month       39898 non-null  float64
 18  Amount_invested_monthly   39898 non-null  float64
 19  Payment_Behaviour         39898 non-null  object
 20  Credit_Score              39898 non-null  int64
dtypes: float64(12), int64(5), object(4)
memory usage: 6.7+ MB

In [55]:
df.to_csv('./data/cleaned_data.csv')